In [1]:
import os
import pandas as pd
import plotly.express as px
import streamlit as st
import matplotlib.pyplot as plt

In [2]:
# 폴더내에 
def read_xlsx_files():
	path = "./data"
	file_list = os.listdir(path)
	lst_xlsx = [file for file in file_list if file.endswith(".xlsx")]
	return lst_xlsx
	


# 데이터 파일 불러오기 및 전처리
def get_excelfile(p_file):
	df = pd.read_excel(
		io = f'./data/{p_file}',
		engine="openpyxl",
		sheet_name="실시간 학생수",
		skiprows=1,
		usecols="A:D",
		nrows=39
	)

	# '반'칼럼 nan값 삭제
	df = df.dropna(axis=0, subset=['반'])

	# 이덱스 리셋
	df = df.reset_index(drop='INDEX')

    # 인원 합계
	df['합계'] = df['남'] + df['여']
	return df

lst_xlsx = read_xlsx_files()

In [3]:
lst_xlsx

['220823.xlsx', '220820.xlsx', '220831.xlsx', '220919.xlsx']

In [4]:
df = get_excelfile('220823.xlsx').ffill()

In [5]:
df

     학년   반   남   여  합계
0   1학년  1반  12  10  22
1   1학년  2반  12  13  25
2   1학년  3반  13  12  25
3   1학년  4반  13  12  25
4   1학년  5반  11  13  24
5   2학년  1반  14  11  25
6   2학년  2반  14  11  25
7   2학년  3반  13  12  25
8   2학년  4반  14  11  25
9   3학년  1반  13  11  24
10  3학년  2반  13  11  24
11  3학년  3반  13  11  24
12  3학년  4반  14   9  23
13  3학년  5반  11  12  23
14  4학년  1반  13  10  23
15  4학년  2반  13  12  25
16  4학년  3반  13  12  25
17  4학년  4반  12  11  23
18  4학년  5반  12  11  23
19  4학년  6반  14  11  25
20  5학년  1반  16  12  28
21  5학년  2반  14  13  27
22  5학년  3반  14  14  28
23  5학년  4반  14  13  27
24  5학년  5반  14  14  28
25  6학년  1반  15  13  28
26  6학년  2반  16  12  28
27  6학년  3반  15  12  27
28  6학년  4반  15  12  27
29  6학년  5반  15  12  27

In [37]:
test = df.groupby('학년').sum()

test_t = test.T.reset_index()
test_t.columns = ['성별', '1학년', '2학년', '3학년', '4학년', '5학년', '6학년']
test_t = test_t.drop(index=2)

col_list = list(test_t)
col_list.remove('성별')
test_t['합계'] = test_t[col_list].sum(axis=1)
test_t

  성별  1학년  2학년  3학년  4학년  5학년  6학년   합계
0  남   61   55   64   77   72   76  405
1  여   60   45   54   67   66   61  353

In [39]:
test_t[['성별','합계']]

  성별   합계
0  남  405
1  여  353

In [40]:
test_t

  성별  1학년  2학년  3학년  4학년  5학년  6학년   합계
0  남   61   55   64   77   72   76  405
1  여   60   45   54   67   66   61  353